Управление_торговлей.ПБТ/src/DataProcessors/ОбработкаРецептурныйРасчет/ОбработкаРецептурныйРасчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаРецептурныйРасчет</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеЖир</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеСахар</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеСОМО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеСВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кислотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроизводства</name>
    <type>
      <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
    </type>
  </attributes>
  <attributes>
    <name>СухиеВеществаФруктов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставЖир</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставСОМО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставСахар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставСВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Жир</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СОМО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сахар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаНесколькоТонн</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставСВФ</name>
      <comment>Состав сухих веществ фруктов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СВФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Управление_торговлей.ПБТ/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d7a580fb-b3d4-4540-9057-2bf42dbcce49">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/Catalogs/вт_ВариантыПроизводстваПоТехКартам/вт_ВариантыПроизводстваПоТехКартам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вт_ВариантыПроизводстваПоТехКартам</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесДетали</name>
    <comment>Вес детали необработанной</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЛитника</name>
    <comment>Вес отходов обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатералЛитника</name>
    <comment>Материал отходов</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПроизводстваСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПроизводстваЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <comment>Плановая расчетная себестоимость</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаСебестоимость</name>
    <type>
      <types>EnumRef.вт_ВариантРасчетаПлановойСебестоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписиСтоимости</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдИзм</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураБрака</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРецепта</name>
    <comment>Код ордера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВведения</name>
    <comment>Дата введения рецепта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗакладки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРецептов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроцент</name>
      <comment>Если ИСТИНА, то поле Количество это проценты</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СписыватьПоВсегоИзготовлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Плановая расчетная себестоимость</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСырья</name>
      <type>
        <types>CatalogRef.ВидыСырья</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Плановая расчетная цена</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОтходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Неликвиды</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентЗакладки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/DataProcessors/ОбработкаРецептурныйРасчет/Forms/Форма/Module.bsl
&НаСервере
Функция ПолучитьСсылкуНаСвойство(ЗаголовокСвойство)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДополнительныеРеквизитыИСведения.Ссылка
	                      |ИЗ
	                      |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	                      |ГДЕ
	                      |	ДополнительныеРеквизитыИСведения.Заголовок = &Заголовок");
	Запрос.УстановитьПараметр("Заголовок",ЗаголовокСвойство);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ТоварыХарактеристикаПриИзмененииНаСервере(ТекХарактеристика)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫРАЗИТЬ(ВЫБОР
	               |				КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвЖир
	               |					ТОГДА ЕСТЬNULL(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ КАК ЧИСЛО)) КАК Жир,
	               |	СУММА(ВЫРАЗИТЬ(ВЫБОР
	               |				КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвСОМО
	               |					ТОГДА ЕСТЬNULL(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ КАК ЧИСЛО)) КАК СОМО,
	               |	СУММА(ВЫРАЗИТЬ(ВЫБОР
	               |				КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвСахар
	               |					ТОГДА ЕСТЬNULL(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ КАК ЧИСЛО)) КАК Сахар,
	               |	СУММА(ВЫРАЗИТЬ(ВЫБОР
	               |				КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвСВ
	               |					ТОГДА ЕСТЬNULL(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ КАК ЧИСЛО)) КАК СВ,
	               |	СУММА(ВЫРАЗИТЬ(ВЫБОР
	               |				КОГДА ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &СвСВФ
	               |					ТОГДА ЕСТЬNULL(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение, 0)
	               |				ИНАЧЕ 0
	               |			КОНЕЦ КАК ЧИСЛО)) КАК СВФ
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	               |ГДЕ
	               |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка = &ТекХарактеристика";
	
	
	
	Запрос.УстановитьПараметр("СвЖир", ПолучитьСсылкуНаСвойство("Жир"));			   
	Запрос.УстановитьПараметр("СвСОМО", ПолучитьСсылкуНаСвойство("СОМО"));			   
	Запрос.УстановитьПараметр("СвСахар", ПолучитьСсылкуНаСвойство("Сахар"));			   
	Запрос.УстановитьПараметр("СвСВ", ПолучитьСсылкуНаСвойство("Сухие вещества"));			   
	Запрос.УстановитьПараметр("СвСВФ", ПолучитьСсылкуНаСвойство("Сухие вещества фруктов"));
	Запрос.УстановитьПараметр("ТекХарактеристика", ТекХарактеристика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Структ = Новый Структура;
	Если Выборка.Следующий() Тогда
		Структ.Вставить("Жир", Выборка.Жир);
		Структ.Вставить("СОМО", Выборка.СОМО);
		Структ.Вставить("Сахар", Выборка.Сахар);
		Структ.Вставить("СВ", Выборка.СВ);
		Структ.Вставить("СВф", Выборка.СВФ);
		Возврат Структ;
	КонецЕсли;
	Структ.Вставить("Жир", 0);
	Структ.Вставить("СОМО", 0);
	Структ.Вставить("Сахар", 0);
	Структ.Вставить("СВ", 0);
	Структ.Вставить("СВФ", 0);	
	Возврат Структ;
		
КонецФункции

&НаСервере
Функция ПолучитьСерию(ТекХарактеристика)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДвиженияСерийТоваровОбороты.Документ.Дата КАК ДокументДата,
	               |	ДвиженияСерийТоваровОбороты.Серия КАК Серия
	               |ИЗ
	               |	РегистрНакопления.ДвиженияСерийТоваров.Обороты(, , , Характеристика = &ТекХарактеристика) КАК ДвиженияСерийТоваровОбороты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДокументДата УБЫВ";
	Запрос.УстановитьПараметр("ТекХарактеристика", ТекХарактеристика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Структ = Новый Структура;
	Если Выборка.Следующий() Тогда
		Структ.Вставить("Серия", Выборка.Серия);
		Возврат Структ;
	КонецЕсли;
	Структ.Вставить("Серия", "");
	Возврат Структ;
		
КонецФункции

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	
	Структ = ТоварыХарактеристикаПриИзмененииНаСервере(Элементы.Товары.ТекущиеДанные.Характеристика);
	
	Элементы.Товары.ТекущиеДанные.СоставЖир = Структ.Жир;
	Элементы.Товары.ТекущиеДанные.СоставСОМО = Структ.СОМО;
	Элементы.Товары.ТекущиеДанные.СоставСахар = Структ.Сахар;
	Элементы.Товары.ТекущиеДанные.СоставСВ = Структ.СВ;
	Элементы.Товары.ТекущиеДанные.СоставСВФ = Структ.СВФ;
	
	СтруктСерия = ПолучитьСерию(Элементы.Товары.ТекущиеДанные.Характеристика);
	Элементы.Товары.ТекущиеДанные.Серия = СтруктСерия.Серия;
	
	РассчитатьСтроку();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаток(ТекНоменклатура, ТекХарактеристика=Неопределено)
	Если ТекХарактеристика = Неопределено Тогда
		ТекХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Номенклатура,
	               |	ТоварыНаСкладахОстатки.Характеристика,
	               |	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Ост
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			,
	               |			Номенклатура = &ТекНоменклатура
	               |				И Характеристика = &ТекХарактеристика
	               |				И Склад = &ТекСклад) КАК ТоварыНаСкладахОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыНаСкладахОстатки.Номенклатура,
	               |	ТоварыНаСкладахОстатки.Характеристика";
				   
	Запрос.УстановитьПараметр("ТекНоменклатура", ТекНоменклатура);			   
	Запрос.УстановитьПараметр("ТекХарактеристика", ТекХарактеристика);			   
	Запрос.УстановитьПараметр("ТекСклад", Объект.Склад);			   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ост;
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьСтроку(ТС=Неопределено)
	
	Если ТС = Неопределено Тогда
		ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Иначе
		ТекСтрока = ТС;
	КонецЕсли;	
	ТекСтрока.Жир = ТекСтрока.Количество * ТекСтрока.СоставЖир;
	ТекСтрока.СОМО = ТекСтрока.Количество * ТекСтрока.СоставСОМО;
	ТекСтрока.Сахар = ТекСтрока.Количество * ТекСтрока.СоставСахар;
	ТекСтрока.СВ = ТекСтрока.Жир + ТекСтрока.СОМО + ТекСтрока.Сахар;
	ТекСтрока.СВФ = ТекСтрока.Количество * ТекСтрока.СоставСВФ;
	
	ТекСтрока.Остаток = ПолучитьОстаток(ТекСтрока.Номенклатура, ТекСтрока.Характеристика);
	
	ТекСтрока.КоличествоНаНесколькоТонн = ТекСтрока.Количество * Объект.Количество / 1000;
	
	Элементы.Товары.ПодчиненныеЭлементы.ТоварыГруппаСодержание.ПодчиненныеЭлементы.ТоварыЖир.ТекстПодвала = Формат(ПолучитьИтоги("Жир")/100,"ЧДЦ=3");
	Элементы.Товары.ПодчиненныеЭлементы.ТоварыГруппаСодержание.ПодчиненныеЭлементы.ТоварыСОМО.ТекстПодвала = Формат(ПолучитьИтоги("СОМО")/100,"ЧДЦ=3");
	Элементы.Товары.ПодчиненныеЭлементы.ТоварыГруппаСодержание.ПодчиненныеЭлементы.ТоварыСахар.ТекстПодвала = Формат(ПолучитьИтоги("Сахар")/100,"ЧДЦ=3");
	Элементы.Товары.ПодчиненныеЭлементы.ТоварыГруппаСодержание.ПодчиненныеЭлементы.ТоварыСВ.ТекстПодвала = Формат(ПолучитьИтоги("СВ")/100,"ЧДЦ=3");
	Элементы.Товары.ПодчиненныеЭлементы.ТоварыГруппаСодержание.ПодчиненныеЭлементы.ТоварыСВФ.ТекстПодвала = Формат(ПолучитьИтоги("СВФ")/100,"ЧДЦ=3");
	Объект.Вода = ""+Формат(1000-ПолучитьИтоги("Количество"),"ЧДЦ=3")+" кг. На несколько тонн - "+(1000-ПолучитьИтоги("Количество"))* Объект.Количество / 1000;
	//Элементы.Вода.Заголовок = "ВОДА";
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	РассчитатьСтроку();	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСпецификациюНаСервере(ДанныеФормы)
	
	Спр = ДанныеФормыВЗначение(ДанныеФормы, Тип("СправочникОбъект.вт_ВариантыПроизводстваПоТехКартам")); 
	//Спр = Справочники.РесурсныеСпецификации.СоздатьЭлемент();
	//Спр.Статус = Перечисления.СтатусыСпецификаций.ВРазработке;
	Спр.Наименование = ""+Объект.Номенклатура+" "+Объект.НомерПартии+" "+Формат(Объект.Дата,"ДФ=dd.MM.yyyy");
	//Спр.НачалоДействия = Объект.Дата;
		
	//Спр.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Спр.Владелец = Объект.Номенклатура;
	//НовСтрокаВыходныеИзделия = Спр.ВыходныеИзделия.Добавить();
	//НовСтрокаВыходныеИзделия.Номенклатура = Объект.Номенклатура;
	Спр.Количество = Объект.Количество;
	//НовСтрокаВыходныеИзделия.КоличествоУпаковок = НовСтрокаВыходныеИзделия.Количество;
	
	Для каждого ТекСтрока из Объект.Товары Цикл
		НовСтрокаМатериалы = Спр.Состав.Добавить();
		НовСтрокаМатериалы.Сырье = ТекСтрока.Номенклатура;
		НовСтрокаМатериалы.Характеристика = ТекСтрока.Характеристика;
		НовСтрокаМатериалы.Количество = ТекСтрока.КоличествоНаНесколькоТонн;//Количество;
	КонецЦикла;	
	//Спр.Записать();
	ЗначениеВДанныеФормы(Спр, ДанныеФормы); 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСпецификацию(Команда)
	
	ФормаНового   = ПолучитьФорму("Справочник.вт_ВариантыПроизводстваПоТехКартам.Форма.ФормаЭлемента"); 
	ДанныеФормы = ФормаНового.Объект; 
		
	СоздатьСпецификациюНаСервере(ДанныеФормы);
	Объект.ВариантПроизводства=ДанныеФормы.Ссылка;
	КопироватьДанныеФормы(ДанныеФормы, ФормаНового.Объект); 
	ФормаНового.Открыть(); 	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИтоги(ТекКолонка)
	
	Возврат Объект.Товары.Итог(ТекКолонка);
	
КонецФункции

&НаКлиенте
Процедура ТоварыСоставЖирПриИзменении(Элемент)
	
	РассчитатьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСоставСОМОПриИзменении(Элемент)
	
	РассчитатьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСоставСахарПриИзменении(Элемент)
	
	РассчитатьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСоставСВПриИзменении(Элемент)
	
	РассчитатьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Для каждого ТекСтрока из Объект.Товары Цикл
		РассчитатьСтроку(ТекСтрока);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)

	Для каждого ТекСтрока из Объект.Товары Цикл
		РассчитатьСтроку(ТекСтрока);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()

	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектНаСервере.ПечатьРецепт();
		
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	
	ТабДокумент = ПечатьНаСервере();
	ТабДокумент.Показать("Рецептурный расчет "+СокрЛП(Объект.НомерПартии)+" от "+Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Элементы.Товары.ТекущиеДанные.Остаток = ПолучитьОстаток(Элементы.Товары.ТекущиеДанные.Номенклатура); 		

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСпецификациюНаСервере(ТекСпец)
	
	//++ 31.01.2018
	//Если ТекСпец.ВыходныеИзделия.Количество() <> 0 Тогда
		Объект.Номенклатура = ТекСпец.Владелец;//ВыходныеИзделия[0].Номенклатура;
		Объект.Количество = ТекСпец.Количество;//ВыходныеИзделия[0].Количество;
	//КонецЕсли;	
		
	Объект.Товары.Очистить();
	Для каждого ТекСтрока из ТекСпец.Состав Цикл //МатериалыИУслуги Цикл
		НовСтрока = Объект.Товары.Добавить();
		НовСтрока.Номенклатура = ТекСтрока.Сырье; //Номенклатура;
		НовСтрока.Характеристика = ТекСтрока.Характеристика;
		СтруктСерия = ПолучитьСерию(ТекСтрока.Характеристика);
		НовСтрока.Серия = СтруктСерия.Серия;
		НовСтрока.Количество = ТекСтрока.Количество / Объект.Количество * 1000;
		//Объект.СтатьяКалькуляции = ТекСтрока.СтатьяКалькуляции;
		
		Если НЕ НовСтрока.Характеристика.Пустая() Тогда
			Структ = ТоварыХарактеристикаПриИзмененииНаСервере(НовСтрока.Характеристика);
			НовСтрока.СоставЖир = Структ.Жир;
			НовСтрока.СоставСОМО = Структ.СОМО;
			НовСтрока.СоставСахар = Структ.Сахар;
			НовСтрока.СоставСВ = Структ.СВ;
			НовСтрока.СоставСВФ = Структ.СВф;

			НовСтрока.Остаток = ПолучитьОстаток(НовСтрока.Номенклатура, НовСтрока.Характеристика);
			НовСтрока.КоличествоНаНесколькоТонн = ТекСтрока.Количество;
			Объект.Вода = ""+Формат(1000-ПолучитьИтоги("Количество"),"ЧДЦ=3")+" кг. На несколько тонн - "+(1000-ПолучитьИтоги("Количество"))* Объект.Количество / 1000;
		Иначе
			НовСтрока.Остаток = ПолучитьОстаток(НовСтрока.Номенклатура); 		
		КонецЕсли;	
		
	КонецЦикла;
	//-- 31.01.2018
			
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСпецификацию(Команда)
	
    Массив = Новый Массив;
     Массив.Добавить(Тип("СправочникСсылка.вт_ВариантыПроизводстваПоТехКартам"));//РесурсныеСпецификации"));

	Оповещение = Новый ОписаниеОповещения("ВводСпецификацииЗавершение", ЭтотОбъект); 
	
	ВыбЗнач = Неопределено;
    ОписаниеТиповК = Новый ОписаниеТипов(Массив);
    ПоказатьВводЗначения(Оповещение, ВыбЗнач, "Выберите спецификацию", ОписаниеТиповК);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводСпецификацииЗавершение(ВыбЗнач, Параметры) Экспорт 
	
	Если ВыбЗнач <> Неопределено Тогда
		ЗагрузитьСпецификациюНаСервере(ВыбЗнач);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.СодержаниеЖир = 15;
	Объект.СодержаниеСОМО = 10;
	Объект.СодержаниеСахар = 15.5;
	Объект.СодержаниеСВ = 40.5;
	Объект.Кислотность = 21;
	Объект.СухиеВеществаФруктов = 1;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписаниеСырья(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВыпускПродукции(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
